/*
* Copyright (C) 2005-2011 MaNGOS <http://getmangos.com/>
* Copyright (C) 2009-2011 MaNGOSZero <https://github.com/mangos/zero>
* Copyright (C) 2011-2016 Nostalrius <https://nostalrius.org>
* Copyright (C) 2016-2017 Elysium Project <https://github.com/elysium-project>
*
* This program is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
*
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License
* along with this program; if not, write to the Free Software
* Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
*/

#ifndef _QZQSTAR_VIP_STR_H
#define _QZQSTAR_VIP_STR_H

typedef struct __teleport_menu {
	uint32			map_id;
	uint32			action_id;
	std::string		text; 
	float           pos[4];
}VIP_Teleport_Menu_t;

#define	__XSTR(x)		((std::string)(x)).c_str()
//#define	__XSTR(x)		(x)

#define	__MAPID_NY		(389)
#define	__MAPID_AH		(43)
#define	__MAPID_SK		(36)
#define	__MAPID_YY		(33)
#define	__MAPID_HA		(48)
#define	__MAPID_TDZZ	(47)
#define	__MAPID_AZ		(90)
#define	__MAPID_XS		(189)
#define	__MAPID_ADM		(70)
#define	__MAPID_TDGD	(129)
#define	__MAPID_ZUL		(209)
#define	__MAPID_MLD		(349)
#define	__MAPID_SM		(109)
#define	__MAPID_HSSY	(230)
#define	__MAPID_EYUN	(429)
#define	__MAPID_STSM	(329)
#define	__MAPID_TL		(289)
#define	__MAPID_HST		(229)

const VIP_Teleport_Menu_t _TELEPORT_Locs[] = 	//All Map id and pos
{
	//Rage Fire
	/* 0 */{ __MAPID_NY, 1011, __XSTR("|奥格弗林特|"),		{ -141.891,38.5473,-38.6893,3.13} },
	/* 1 */{ __MAPID_NY, 1012, __XSTR("|塔拉加曼|"),		{ -242.232, 160.986, -18.6803, 4.5} },
	/* 2 */{ __MAPID_NY, 1013, __XSTR("|巴扎兰|"),			{ -369.692,147.088,7.73849,3.4} },
	/* 3 */{ __MAPID_NY, 1014, __XSTR("|耶戈什|"),			{ -390.431,196.757,-21.3856,0.3} },

	//AiHao
	/* 0 */{ __MAPID_AH, 1021, __XSTR("|乌龟|"),			{ -3.28575,244.268,-106.354,0 } },
	/* 1 */{ __MAPID_AH, 1022, __XSTR("|布莱恩|"),			{ -110.498,411.38,-74.1882,0 } },
	/* 2 */{ __MAPID_AH, 1023, __XSTR("|皮萨斯|"),			{ 12.1153,-219.583,-79.4438,0 } },
	/* 3 */{ __MAPID_AH, 1024, __XSTR("|蜥蜴|"),			{ -273.254,-312.388,-69.0908,0 } },
	/* 4 */{ __MAPID_AH, 1025, __XSTR("|瑟芬迪斯|"),		{ -117.358,5.59934,-29.3482,0 } },
	/* 5 */{ __MAPID_AH, 1026, __XSTR("|沃尔丹|"),		{ -117.358,5.59934,-29.3482,0} },

	//SK
	/* 0 */{ __MAPID_SK, 1031, __XSTR("|拉克佐|"),			{ -186.165,-423.484,54.1799,0 } },
	/* 1 */{ __MAPID_SK, 1032, __XSTR("|伐木机|"),		{ -277.253,-534.617,49.4457,0 } },
	/* 2 */{ __MAPID_SK, 1033, __XSTR("|基尔尼格|"),		{ -186.853,-585.425,32.9978,0 } },
	/* 3 */{ __MAPID_SK, 1034, __XSTR("|重拳先生|"),			{ -23.9936,-818.105,34.1894,0 } },
	/* 4 */{ __MAPID_SK, 1035, __XSTR("|范克里夫|"),		{ -51.7033,-819.674,51.6584,0 } },

	//YY
	/* 0 */{ __MAPID_YY, 1041, __XSTR("|狼人|"),{ -250.334,2143.63,87.013,0 } },
	/* 1 */{ __MAPID_YY, 1042, __XSTR("|屠夫|"),{ -184.457,2244.2,76.2014,0 } },
	/* 2 */{ __MAPID_YY, 1043, __XSTR("|男爵|"),{ -277.034,2291.46,81.823,0 } },
	/* 3 */{ __MAPID_YY, 1044, __XSTR("|指挥官|"),{ -240.866,2252.39,101.395,0 } },
	/* 4 */{ __MAPID_YY, 1045, __XSTR("|盲眼|"),{ -252.083,2147.64,100.029,0 } },
	/* 5 */{ __MAPID_YY, 1046, __XSTR("|吞噬者|"),{ -164.07,2180.23,129.26,0 } },
	/* 6 */{ __MAPID_YY, 1047, __XSTR("|狼王|"),{ -148.366,2172.98,155.679,0 } },
	/* 7 */{ __MAPID_YY, 1048, __XSTR("|阿鲁高|"),{ -95.1507,2167.02,155.687,0 } },

	//HA
	/* 0 */{ __MAPID_HA, 1051, __XSTR("|加摩拉|"),{ -446.137,213.9,-52.8624,0 } },
	/* 1 */{ __MAPID_HA, 1052, __XSTR("|鱼人|"),{ -413.267,40.9866,-48.2067,0 } },
	/* 2 */{ __MAPID_HA, 1053, __XSTR("|祭坛|"),{ -821.233,-152.37,-25.9156,0 } },

	//TDZZ
	/* 0 */{ __MAPID_TDZZ, 1061, __XSTR("|阿格姆|"),{ 2106.62,1455.27,73.6281,0 } },
	/* 1 */{ __MAPID_TDZZ, 1062, __XSTR("|亡语者|"),{ 2139.51,1447.6,79.0904,0 } },
	/* 2 */{ __MAPID_TDZZ, 1063, __XSTR("|主宰|"),{ 2203.28,1618.22,82.8193,0 } },
	/* 3 */{ __MAPID_TDZZ, 1064, __XSTR("|野猪|"),{ 2018.23,2003.35,61.6509,0 } },
	/* 4 */{ __MAPID_TDZZ, 1065, __XSTR("|刺肋|"),{ 2198.1,1892.36,71.9167,0 } },

	//AZ
	/* 0 */{ __MAPID_AZ, 1071, __XSTR("|水元素|"),{ -452.519,100.729,-210.225,0 } },
	/* 1 */{ __MAPID_AZ, 1072, __XSTR("|电刑器|"),{ -541.282,494.681,-216.81,0 } },
	/* 2 */{ __MAPID_AZ, 1073, __XSTR("|群体打击者|"),{ -897.557,375.95,-272.596,0 } },
	/* 3 */{ __MAPID_AZ, 1074, __XSTR("|麦克尼尔|"),{ -557.307,670.066,-327.046,0 } },

	//XS
	/* 0 */{ __MAPID_XS, 1081, __XSTR("|血法师|"),{ 1804.6, 1428, -8.8, 0 } },
	/* 1 */{ __MAPID_XS, 1082, __XSTR("|杜安|"),{ 136.054,-442.242,18.5247,0 } },
	/* 2 */{ __MAPID_XS, 1083, __XSTR("|赫罗德|"),{ 1978.91,-432.075,11.2724,0 } },
	/* 3 */{ __MAPID_XS, 1084, __XSTR("|狗男女|"),{ 1168.85,1427.03,32.0099,0 } },

	//ADM
	/* 0 */{ __MAPID_ADM, 1091, __XSTR("|附魔|"),{ -159.933,197.74,-49.8996,0 } },
	/* 1 */{ __MAPID_ADM, 1092, __XSTR("|穴居人|"),{ -235.489,151.878,-44.0362,0 } },
	/* 2 */{ __MAPID_ADM, 1093, __XSTR("|加加恩|"),{ 4.11668,402.216,-46.8995,0 } },
	/* 3 */{ __MAPID_ADM, 1094, __XSTR("|法杖箱|"),{ -359.832,113.83,-43.8491,0 } },
	/* 4 */{ __MAPID_ADM, 1095, __XSTR("|格瑞姆|"),{ 43.585,431.352,-41.0414,0 } },
	/* 5 */{ __MAPID_ADM, 1096, __XSTR("|看守祭坛|"),{ 76.3427,258.266,-26.5877,0 } },
	/* 6 */{ __MAPID_ADM, 1097, __XSTR("|石头王座|"),{ 75.4662,258.431,-52.2046,0 } },

	//TDGD
	/* 0 */{ __MAPID_TDGD, 1101, __XSTR("|敲锣|"),{ 2513.84,862.305,47.6781,0 } },
	/* 1 */{ __MAPID_TDGD, 1102, __XSTR("|火眼骷髅|"),{ 2450.63,693.866,54.8871,0 } },
	/* 2 */{ __MAPID_TDGD, 1103, __XSTR("|胖子|"),{ 2364.78,1047.3,25.5754,0 } },
	/* 3 */{ __MAPID_TDGD, 1104, __XSTR("|寒冰之王|"),{ 2383.93,950.301,55.5289,0 } },

	//ZUL
	/* 0 */{ __MAPID_ZUL, 1111, __XSTR("|安图苏尔|"),{ 1809.22,669.459,15.3067,0 } },
	/* 1 */{ __MAPID_ZUL, 1112, __XSTR("|巫医|"),{ 1910.62,1011.42,11.5156,0 } },
	/* 2 */{ __MAPID_ZUL, 1113, __XSTR("|百人|"),{ 1885.26,1263.08,41.5177,0 } },
	/* 3 */{ __MAPID_ZUL, 1114, __XSTR("|尾王|"),{ 1750.18,1049.5,48.5179,0 } },

	//MLD
	/* 0 */{ __MAPID_MLD, 1121, __XSTR("|维利塔恩|"),{ 700.672,-226.238,-47.2871,0 } },
	/* 1 */{ __MAPID_MLD, 1122, __XSTR("|诺克塞恩|"),{ 1147.86,-226.774,-79.1884,0 } },
	/* 2 */{ __MAPID_MLD, 1123, __XSTR("|塞雷布拉斯|"),{ 754.376,59.0968,-88.149,0 } },
	/* 3 */{ __MAPID_MLD, 1124, __XSTR("|兰斯利德|"),{ 328.82,-204.922,-59.8991,0 } },
	/* 4 */{ __MAPID_MLD, 1125, __XSTR("|吉兹洛克|"),{ 158.56,-310.849,-173.804,0 } },
	/* 5 */{ __MAPID_MLD, 1126, __XSTR("|尖刺花|"),{ 968.743,-30.8889,-62.8298,0 } },
	/* 6 */{ __MAPID_MLD, 1127, __XSTR("|瑟莱德公主|"),{ -16.0837,47.3142,-127.11,0 } },

	//SM
	/* 0 */{ __MAPID_SM, 1131, __XSTR("|阳台1|"),{ -409.577,62.4995,-67.0678,0 } },
	/* 1 */{ __MAPID_SM, 1132, __XSTR("|阳台2|"),{ -466.854,30.0278,-66.7908,0 } },
	/* 2 */{ __MAPID_SM, 1133, __XSTR("|阳台3|"),{ -525.828,61.1839,-66.7188,0 } },
	/* 3 */{ __MAPID_SM, 1134, __XSTR("|阳台4|"),{ -526.559,128.37,-66.7532,0 } },
	/* 4 */{ __MAPID_SM, 1135, __XSTR("|阳台5|"),{ -468.52,165.22,-66.7026,0 } },
	/* 5 */{ __MAPID_SM, 1136, __XSTR("|阳台6|"),{ -407.262,133.265,-66.9138,0 } },
	/* 6 */{ __MAPID_SM, 1137, __XSTR("|沉睡大厅|"),{ -671.148,-12.0235,-90.8358, 0 } },

	//HSSY
	/* 0 */{ __MAPID_HSSY, 1141, __XSTR("|火BOSS|"),{ 918.619,-298.104,-71.7566,0 } },
	/* 1 */{ __MAPID_HSSY, 1142, __XSTR("|典狱官|"),{ 813.781,-365.411,-50.1963,0 } },
	/* 2 */{ __MAPID_HSSY, 1143, __XSTR("|控火罗格|"),{ 538.955,-261.066,-43.1013,0 } },
	/* 3 */{ __MAPID_HSSY, 1144, __XSTR("|安格将军|"),{ 676.689,20.9389,-52.0795,0 } },
	/* 4 */{ __MAPID_HSSY, 1145, __XSTR("|傀儡统帅|"),{ 824.453,20.0102,-53.6998,0 } },
	/* 5 */{ __MAPID_HSSY, 1146, __XSTR("|黑铁酒吧|"),{ 887.359,-193.638,-43.7034,0 } },
	/* 6 */{ __MAPID_HSSY, 1147, __XSTR("|七贤|"),{ 1231.09,-207.052,-85.6736,0 } },
	/* 7 */{ __MAPID_HSSY, 1148, __XSTR("|大帝|"),{ 1369.75,-847.3,-87.7221,0 } },

	//EYUN
	/* 0 */{ __MAPID_EYUN, 1151, __XSTR("|伊莫格尔|"),{ -39.2038,799.39,-29.5357,0 } },
	/* 1 */{ __MAPID_EYUN, 1152, __XSTR("|伊琳娜|"),{ -117.774,525.82,28.605,0 } },
	/* 2 */{ __MAPID_EYUN, 1153, __XSTR("|戈多克大王|"),{ 800.779,491.201,37.3184,0 } },
	/* 3 */{ __MAPID_EYUN, 1154, __XSTR("|图书馆|"),{ 129.377,553.027,-35.371,0 } },
	/* 4 */{ __MAPID_EYUN, 1155, __XSTR("|奥兹恩|"),{ 254.146,-414.002,-119.962,0 } },
	/* 5 */{ __MAPID_EYUN, 1156, __XSTR("|海多斯|"),{ 15.1435,-415.292,-59.9504,0 } },
	/* 6 */{ __MAPID_EYUN, 1157, __XSTR("|瑟雷姆|"),{ -51.9976,-465.695,-37.9613,0 } },

	//STSM
	/* 0 */{ __MAPID_STSM, 1161, __XSTR("|镇长|"),{ 3650.41,-3594.45,137.458,0 } },
	/* 1 */{ __MAPID_STSM, 1162, __XSTR("|炮手|"),{ 3565.43,-2937.61,125.521,0 } },
	/* 2 */{ __MAPID_STSM, 1163, __XSTR("|大十字军|"),{ 3412.09,-3068.03,136.528,0 } },
	/* 3 */{ __MAPID_STSM, 1164, __XSTR("|瑞文戴尔|"),{ 4043.52,-3462.41,121.548,0 } },

	//TL
	/* 0 */{ __MAPID_TL, 1171, __XSTR("|普克尔特|"),{ 280.879,4.63818,85.2283,0 } },
	/* 1 */{ __MAPID_TL, 1172, __XSTR("|瑟尔林|"),{ 185.88,-100.691,85.2283,0 } },
	/* 2 */{ __MAPID_TL, 1173, __XSTR("|玛丽希亚|"),{ 80.0734,1.2349,85.2283,0 } },
	/* 3 */{ __MAPID_TL, 1174, __XSTR("|伊露希亚|"),{ 273.068,-6.10705,75.25,0 } },
	/* 4 */{ __MAPID_TL, 1175, __XSTR("|阿雷克斯|"),{ 182.924,-76.3018,70.7734,0 } },
	/* 5 */{ __MAPID_TL, 1176, __XSTR("|拉文尼亚|"),{ 120.927,-2.36208,75.3978,0 } },
	/* 6 */{ __MAPID_TL, 1177, __XSTR("|通灵院长|"),{ 179.258,-7.65121,75.4979,0 } },
	/* 7 */{ __MAPID_TL, 1178, __XSTR("|霜语|"),{ -21.9245,141.082,83.9273,0 } },
	
	//HST
	/* 0 */{ __MAPID_HST, 1181, __XSTR("|指挥官沃恩|"),{ -8.03464,-444.109,-18.6442,0 } },
	/* 1 */{ __MAPID_HST, 1182, __XSTR("|欧莫克大王|"),{ -56.401,-296.108,45.5549,0 } },
	/* 2 */{ __MAPID_HST, 1183, __XSTR("|军需官|"),{ -180.439,-477.173,88.2968,0 } },
	/* 3 */{ __MAPID_HST, 1184, __XSTR("|维姆萨拉克|"),{ -65.9607,-485.856,90.7021,0 } },
	/* 4 */{ __MAPID_HST, 1185, __XSTR("|雷德黑手|"),{ 125.54,-419.176,110.472,0 } },
	/* 5 */{ __MAPID_HST, 1186, __XSTR("|比斯巨兽|"),{ 85.2606,-564.425,110.849,0 } },
	/* 6 */{ __MAPID_HST, 1187, __XSTR("|将军|"),{ -21.3346,-301.927,110.942,0 } },

};


#endif	//_QZQSTAR_VIP_STR_H

